# ðŸ“˜ Notebook 01 - Exploratory Data Analysis (EDA)

### ðŸŽ¯ Goal of this notebook:

At the end of this notebook, it could be possible to answer:

- "What kind of customer do we have, and how do the differ?"

No clustering yet. Only understandig the data.

In [34]:
# Imports
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

## 1. Look and explore data
#### Load and examine the dataset:

In [47]:
# Load dataset
df = pd.read_csv('../data/raw/Mall_Customers.csv')

# First look at data
df.head()
df.tail()
df.sample(5)

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
187         188    Male   28                 101                      68
5             6  Female   22                  17                      76
55           56    Male   47                  43                      41
70           71    Male   70                  49                      55
50           51  Female   49                  42                      52

In [46]:
# Dataset dimensions
df.shape

# Column information
df.info()
df.dtypes

# Statistical summary
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

## 2. Data Quality Assessment

#### Check for missing values and duplicates:

In [51]:
# Missing values

df.isnull().sum()
df.isna().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64